In [2]:
import numpy as np
import pandas as pd
import os

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

# import warnings;
# warnings.filterwarnings("ignore")

In [3]:
df = pd.read_csv('./Sales_Data/Sales_April_2019.csv')

#bu yolu cok begendim,eger her yaptigin sey toplu halde ayni yerde bulunmasini istemiyorsan,
#bu sekilde yol yazarak o dosyaya ulasabilirsin, burda önemli olan,
#senin Notebook unu nerede actigin ve acacagin dosya kac adim sonrasinda bulunuyor,
#bu örnekte ben SalesAnalyses de actim Notebook u ama okuyacagim 
#dosya nu notebook ile ayni klasörde de degildi,bir alt klasördeydi
#Sales_DAta adinda onun icin ben bu sekilde yol yazarak olan ulastim,ve okuttum.



#ama bu adimi kullanmayacagiz,cünkü asagida tüm aylari birlestirip tek bir csv dosyasi yapacagiz.
df.head(2)




#BIR GÜZEL YAZIM SEKLI, HOCANIN SÖYLEDIGI OBJECT ORIENTED METHODA UYGUN
#

#path='./Sales_Data/Sales_April_2019.csv' diye bir degisken atiyor
#df=pd.read_csv(path)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
#simdi bu klasörde 12 tane dosya var bunlari tek klaöre getirmek daha mantikli,bir sonraki adimda
#bunlari tek klasöre getirecegiz
#bunu yapan adamda netten bakti ve cözümü kendine göre uyarladi


#BU ADIMDA BIRLESTIRME YAPMAYACAK,DOSYALARI TEK BIR KLASÖRE ALACAK
#BIRLESTIRMEYI ASAGIDA CONCATENATE YÖNTEMIYLE YAPACAK



#ADAM BUNU GOOGLE ----->.  READ ALL FILES FROM DIRECTORY YAZARAK BULDU 


path = "./Sales_Data"
files = [file for file in os.listdir("./Sales_Data") if not file.startswith('.')] # Ignore hidden files

files

#bununla tüm dosyalari yakaladik ve bir degislene atadik
#files demek ,aslinda tüm ay dosyalarinin toplu bulundugu bir degisken oldu

#simdi biz bununla yol yazarak Sales_Data alt klasöründeki dosyalara ulastik
#ve onlari yazdirdik

['Sales_December_2019.csv',
 'Sales_April_2019.csv',
 'Sales_February_2019.csv',
 'Sales_March_2019.csv',
 'Sales_August_2019.csv',
 'Sales_May_2019.csv',
 'Sales_November_2019.csv',
 'Sales_October_2019.csv',
 'Sales_January_2019.csv',
 'Sales_September_2019.csv',
 'Sales_July_2019.csv',
 'Sales_June_2019.csv']

In [5]:
files=[file for file in os.listdir('./Sales_Data')]

for file in files:
    print(file)
    
#yukarida yaptigim gibi aslinda ama ben print ile files icine sakladigim dosyalari teker teker yazdirdim

Sales_December_2019.csv
Sales_April_2019.csv
Sales_February_2019.csv
Sales_March_2019.csv
Sales_August_2019.csv
Sales_May_2019.csv
Sales_November_2019.csv
Sales_October_2019.csv
Sales_January_2019.csv
Sales_September_2019.csv
Sales_July_2019.csv
Sales_June_2019.csv

In [6]:
print(files)

#bu sekilde print olmadan yazdirmayi denedim ama tam güzel bir cikti vermedi,
#liste tipinde bir cikti verdi

['Sales_December_2019.csv', 'Sales_April_2019.csv', 'Sales_February_2019.csv', 'Sales_March_2019.csv', 'Sales_August_2019.csv', 'Sales_May_2019.csv', 'Sales_November_2019.csv', 'Sales_October_2019.csv', 'Sales_January_2019.csv', 'Sales_September_2019.csv', 'Sales_July_2019.csv', 'Sales_June_2019.csv']

# ay ay verilmis dosyalari tek bir dosyada toplama

In [7]:
#simdi yukarida bu dosyalari tek bir files dosyasinda tutuyorduk,simdi bunlari Concatenate yapalim
#adam sunu yazdi googleye
#'how do you concatenate dataFrame in pandas' adam bunu yazdi google 

df = pd.read_csv('./Sales_Data/Sales_April_2019.csv') #bunun koda bir etkisi yok

all_months_data = pd.DataFrame() #bos bir dataFrame olusturdum


for file in files:
    df = pd.read_csv('./Sales_Data/' +  file)
    all_months_data = pd.concat([all_months_data,df])
    
all_months_data.to_csv('all_data.csv',index=False) #adam burda False yapti,ve index numaralari
#olmadan büyük bir liste olusturdu, ben bunu True yaparak,indexli bir büyük liste olusturdum.

#12 tane olan dosyayi all_data adinda bir dosyada topladi

all_months_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

## read ni updated dataframe

In [8]:
all_data = pd.read_csv('all_data.csv')
all_data

#buda güzel bir okma sekli,bir degiskene atayip,degisken adini cagirarak dosyayi okuma
#object orientierte dahil olan bir yazim sekli olabilir

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"
...,...,...,...,...,...,...
186845,222905,AAA Batteries (4-pack),1,2.99,06/07/19 19:02,"795 Pine St, Boston, MA 02215"
186846,222906,27in FHD Monitor,1,149.99,06/01/19 19:29,"495 North St, New York City, NY 10001"
186847,222907,USB-C Charging Cable,1,11.95,06/22/19 18:57,"319 Ridge St, San Francisco, CA 94016"
186848,222908,USB-C Charging Cable,1,11.95,06/26/19 18:35,"916 Main St, San Francisco, CA 94016"
186849,222909,AAA Batteries (4-pack),1,2.99,06/25/19 14:33,"209 11th St, Atlanta, GA 30301"

## Clean up the data

In [26]:
## NAN degerlerin tespiti ve silinmesi . I want to drop rows of NAN

In [27]:
all_data.isna().head(3)

#burda isna() NAN olanlara true yaziyor olmayanlara False yaziyor, bu sekilde görmem zor oldugu icin
#asagida bazi oynamalar yaptim,

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False

In [28]:
all_data.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [29]:
all_data.isna().any(axis=1)#bu sekilde de tüm sütunlardakileri tek kolon halinde yaziyor

#

#bundan cikan sonuclar True veya False oldugu icin, bunu alip ben ,kendi datamin icine yazarsam
#direkt NAN olanlar ortaya cikiyor, cünkü tablo degerlerinde False olan gözükmeyecek,
#True olan gözülecek ve bir tablo ortaya cikacak

0         False
1         False
2         False
3         False
4         False
          ...
186845    False
186846    False
186847    False
186848    False
186849    False
Length: 186850, dtype: bool

In [30]:
all_data[all_data.isna().any(axis=1)] #yukarida anlattigim seyin burdaki hali

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
264,NaN,NaN,NaN,NaN,NaN,NaN
648,NaN,NaN,NaN,NaN,NaN,NaN
680,NaN,NaN,NaN,NaN,NaN,NaN
1385,NaN,NaN,NaN,NaN,NaN,NaN
1495,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
185795,NaN,NaN,NaN,NaN,NaN,NaN
185868,NaN,NaN,NaN,NaN,NaN,NaN
185887,NaN,NaN,NaN,NaN,NaN,NaN
185960,NaN,NaN,NaN,NaN,NaN,NaN
186580,NaN,NaN,NaN,NaN,NaN,NaN

In [31]:
all_data.isna().value_counts()

#burda value_counts yaparak hangi cesitlerden kacar tane olduguna baktim,
#False lardan 186305 tane True yani NAN lardan 545 tane var,

Order ID  Product  Quantity Ordered  Price Each  Order Date  Purchase Address
False     False    False             False       False       False               186305
True      True     True              True        True        True                   545
dtype: int64

In [32]:
all_data.isna().sum()

#bu yüntem aslinda icinde NAN degerlerin sayisini veriyor.
#burda NaN degerlerin her bir kolonda ayni olmasi bana ,bu satirlarin icindeki hersey komple NaN 
#olduguna isaret ediyor gibi geldi

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [33]:
all_data.shape[0]

186850

### simdi artik sorumuzun cözümüne gecelim

In [35]:
nan_df = all_data[all_data.isna().any(axis=1)] #Nan olan degerler
nan_df.head()

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
264       NaN     NaN              NaN        NaN        NaN              NaN
648       NaN     NaN              NaN        NaN        NaN              NaN
680       NaN     NaN              NaN        NaN        NaN              NaN
1385      NaN     NaN              NaN        NaN        NaN              NaN
1495      NaN     NaN              NaN        NaN        NaN              NaN

In [16]:
all_data = all_data.dropna(how = 'all') 
#(how = 'all')  burda tüm satir eger NAN ise siliyor,(how = 'any')  yapsaydim,
#birtane bile olsa silerdi






#burayi biraz daha düsünmem lazim, cikan cevap yazdigim bilgilerle celisiyor
#all yapinca 545 kaliyor yine, 'any' yapinca sifir kaliyor
#ozaman tüm satirlar komple NaN degil

In [17]:
all_data.isna().value_counts()

Order ID  Product  Quantity Ordered  Price Each  Order Date  Purchase Address
False     False    False             False       False       False               186305
dtype: int64

In [38]:
all_data['Order Date'].value_counts()

#ben burda görüyorum ki Order datada icinde farkli olan 'Order Date' yazan yerler var
#normalde onlarin icinde tarih yazmasi gerekirdi

Order Date        355
12/15/19 20:16      8
12/11/19 13:24      7
10/30/19 21:28      7
04/02/19 13:24      7
                 ...
08/06/19 08:32      1
08/18/19 20:27      1
08/30/19 16:29      1
08/15/19 14:05      1
06/25/19 14:33      1
Name: Order Date, Length: 142396, dtype: int64

In [45]:
or_date = all_data[all_data['Order Date'] == 'Order Date']
or_date['Order Date'].str[0:2]

254       Or
705       Or
1101      Or
2875      Or
3708      Or
          ..
183671    Or
184012    Or
184041    Or
184275    Or
186532    Or
Name: Order Date, Length: 355, dtype: object

### icinde 'or' yazanlari temizleyegim

In [18]:
#soruda icinde or yazan yerleri temizleyecegim

orlu_data = all_data[all_data['Order Date'].str[0:2] == 'Or']
orlu_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
254,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
705,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1101,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2875,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
3708,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [19]:
orlu_data.shape[0]    #icinde 'or' olan 355 tane satir varmis

355

In [50]:
orlu_data = all_data[all_data['Order Date'] == 'Order Date']
all_data = all_data[all_data['Order Date'] != 'Order Date'] #bu hamle ise
#icinde 'Order Date' olmayanlari gercek data ma esitledim ve icinde 'Order Date' olanlardan kurtulmus oldum

In [52]:
all_data.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [67]:
all_data[all_data['Order Date'] == 'Order Date' ] 
#burdada yukaridaki islemden sonra icinde 'Order DAte' kalmadigini götm+s oldum

Empty DataFrame
Columns: [Order ID, Product, Quantity Ordered, Price Each, Order Date, Purchase Address]
Index: []

In [68]:
#BURDA ADAM ZEKICE BISEY YAPTI, ORLU OLANLARI BULDU ONU ALIP, 
#all_datayi 'or' lu olmayanlara != ile esitleyecek

all_data = all_data[all_data['Order Date'].str[0:2] != 'Or']

AttributeError: Can only use .str accessor with string values!

In [69]:
all_data['Order Date'] = all_data['Order Date'].astype('datetime64')

In [70]:
all_data['Order Date'].apply(lambda x : np.nan if x=='Oder Date' else x)

0        2019-12-30 00:01:00
1        2019-12-29 07:03:00
2        2019-12-12 18:21:00
3        2019-12-22 15:13:00
4        2019-12-18 12:38:00
                 ...
186845   2019-06-07 19:02:00
186846   2019-06-01 19:29:00
186847   2019-06-22 18:57:00
186848   2019-06-26 18:35:00
186849   2019-06-25 14:33:00
Name: Order Date, Length: 186495, dtype: datetime64[ns]

In [77]:
all_data.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [76]:
all_data['Order Date'].dropna(how = 'all', axis = 0 , inplace = True)

In [72]:
all_data['Order Date'].astype('datetime64')

0        2019-12-30 00:01:00
1        2019-12-29 07:03:00
2        2019-12-12 18:21:00
3        2019-12-22 15:13:00
4        2019-12-18 12:38:00
                 ...
186845   2019-06-07 19:02:00
186846   2019-06-01 19:29:00
186847   2019-06-22 18:57:00
186848   2019-06-26 18:35:00
186849   2019-06-25 14:33:00
Name: Order Date, Length: 186495, dtype: datetime64[ns]

In [73]:
all_data.dtypes

Order ID                    object
Product                     object
Quantity Ordered            object
Price Each                  object
Order Date          datetime64[ns]
Purchase Address            object
dtype: object

In [74]:
all_data.head(2)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001"

In [ ]:
all_data['Quantity Ordered'] = all_data['Quantity Ordered'].astype('int32')
all_data['Price Each'] = all_data['Price Each'].astype('float32')

In [21]:
# burda ay bizim kriterimiz oldugu icin aylarin kategorize edilmesi kolay olmasi icin,
#aylari ayri bir sütuna ekliyorum

all_data['Month'] = all_data['Order Date'].str[0:2]  #bu sekilde kalirsa string olarak kalacak,bunu int a cevirecegim
all_data['Month'] = all_data['Month'].astype('int32')
all_data.head(3)



#burda ben yukarda aylari kesip yeni bir sütun olusturmustum, onlar icinde 'or' yazanlar varmis
#benim simdi onlari bulmam gerekir,bunuda yukarida yapacagim

#yukarda 'or' lari buldu ve != ile 'or' olmayanlari bizim data FRame mize esitleyerek 'or' lardan kurtuldu

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",12
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12

In [22]:
all_data['Order Date'] == 'Order Date'

0         False
1         False
2         False
3         False
4         False
          ...
186845    False
186846    False
186847    False
186848    False
186849    False
Name: Order Date, Length: 185950, dtype: bool

## What was the best month for sales? how much was earned that month?

In [23]:
#simdi bizim burda en cok kazanci olan ayi ve nekadar kazanc oldugunu bulmamiz gerekecek
#altta yapayacim islemde hata alacagim, cünkü ben iki kolonu, satisi bulmak icin carpacagim
#ama icindeki sayilar nümeric yani sayisal olmadigi icin kabul etmeyecek,
#önce benim bu sütunlari numerical yapmam lazim,

#astype ile yapabilirim ama, ne kadar verecegimi tam bilemiyorum int32 mi int 64 mü

#bunu icin baska bir yöntem var 
#pd.to_numeric(all_data['Quantity Ordered']) diye.



all_data['Quantity Ordered'] = pd.to_numeric(all_data['Quantity Ordered'])
all_data['Price Each'] = pd.to_numeric(all_data['Price Each'])

In [24]:
all_data['Sales'] = all_data['Quantity Ordered'] * all_data['Price Each']
all_data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales
0,295665,Macbook Pro Laptop,1,1700.00,12/30/19 00:01,"136 Church St, New York City, NY 10001",12,1700.00
1,295666,LG Washing Machine,1,600.00,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12,600.00
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12,11.95
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",12,149.99
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",12,11.95
...,...,...,...,...,...,...,...,...
186845,222905,AAA Batteries (4-pack),1,2.99,06/07/19 19:02,"795 Pine St, Boston, MA 02215",6,2.99
186846,222906,27in FHD Monitor,1,149.99,06/01/19 19:29,"495 North St, New York City, NY 10001",6,149.99
186847,222907,USB-C Charging Cable,1,11.95,06/22/19 18:57,"319 Ridge St, San Francisco, CA 94016",6,11.95
186848,222908,USB-C Charging Cable,1,11.95,06/26/19 18:35,"916 Main St, San Francisco, CA 94016",6,11.95
186849,222909,AAA Batteries (4-pack),1,2.99,06/25/19 14:33,"209 11th St, Atlanta, GA 30301",6,2.99

In [25]:
all_data['Quantity Ordered'].value_counts()

#bu gerekli degil ama tabloda hep bir görünce  kacar tane alinmis diye bir bakayim dedim,

1    168552
2     13324
3      2920
4       806
5       236
6        80
7        24
8         5
9         3
Name: Quantity Ordered, dtype: int64

In [26]:
#simdi satislardan gelen kazanclari buldum, simdide bunlari aylara göre düzenleyeyim
#groupby methodu ile yapiyoruz

all_data.groupby('Month')

In [27]:
all_data.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales
0,295665,Macbook Pro Laptop,1,1700.00,12/30/19 00:01,"136 Church St, New York City, NY 10001",12,1700.00
1,295666,LG Washing Machine,1,600.00,12/29/19 07:03,"562 2nd St, New York City, NY 10001",12,600.00
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",12,11.95

In [28]:
all_data['Month'].value_counts()

#burda yine nem hangi ayda kaparca alisveris yapilmis diye bakayim dedim

12    24984
10    20282
4     18279
11    17573
5     16566
3     15153
7     14293
6     13554
2     11975
8     11961
9     11621
1      9709
Name: Month, dtype: int64

In [29]:
#simdide ben toplam satis sayilarina göre siralayayim

all_data.groupby('Month').sum()

#bu sekilde tüm tabloyu görüyorum ,eger ben sonuna [Sales] koyarsam sadece Sales görecegim

#all_data.groupby('Month').sum()['Sales']

#encok satis aralik ayinda yapilmis

       Quantity Ordered  Price Each       Sales
Month
1                 10903  1811768.38  1822256.73
2                 13449  2188884.72  2202022.42
3                 17005  2791207.83  2807100.38
4                 20558  3367671.02  3390670.24
5                 18667  3135125.13  3152606.75
6                 15253  2562025.61  2577802.26
7                 16072  2632539.56  2647775.76
8                 13448  2230345.42  2244467.88
9                 13109  2084992.09  2097560.13
10                22703  3715554.83  3736726.88
11                19798  3180600.68  3199603.20
12                28114  4588415.41  4613443.34

In [ ]:


#video 31,15 te kaldim